In [110]:
import pandas as pd
import seaborn as sns

In [111]:
df = pd.read_csv("loan.csv")

In [112]:
df.head(5)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,LoanAmount
0,LP1000,Male,Yes,2,Graduate,No,16337,370.0
1,LP1001,NaN,Yes,0,Graduate,NaN,24986,280.0
2,LP1002,Female,Yes,0,Graduate,No,8812,190.0
3,LP1003,Female,Yes,3+,Graduate,No,6820,340.0
4,LP1004,Male,No,2,Graduate,No,14716,NaN

In [113]:
df.shape

(100, 8)

In [114]:
df.isnull().sum()

Loan_ID             0
Gender              9
Married             3
Dependents         10
Education           0
Self_Employed      17
ApplicantIncome     0
LoanAmount         19
dtype: int64

In [115]:
# df.fillna(10)                       # it will fill everyplace by 10

# its not a good practice because it fills everywhere 10 you can see in the gender it fills 10

In [116]:
df.isnull().sum()

Loan_ID             0
Gender              9
Married             3
Dependents         10
Education           0
Self_Employed      17
ApplicantIncome     0
LoanAmount         19
dtype: int64

In [117]:
df.head(10)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Loan_ID          100 non-null    object
 1   Gender           91 non-null     object
 2   Married          97 non-null     object
 3   Dependents       90 non-null     object
 4   Education        100 non-null    object
 5   Self_Employed    83 non-null     object
 6   ApplicantIncome  100 non-null    int64
 7   LoanAmount       81 non-null     float64
dtypes: float64(1), int64(1), object(6)
memory usage: 6.4+ KB

In [118]:
for i in df.select_dtypes(include="float64").columns:
    df[i].fillna(df["LoanAmount"].mode()[0],inplace=True)
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,LoanAmount
0,LP1000,Male,Yes,2,Graduate,No,16337,370.0
1,LP1001,NaN,Yes,0,Graduate,NaN,24986,280.0
2,LP1002,Female,Yes,0,Graduate,No,8812,190.0
3,LP1003,Female,Yes,3+,Graduate,No,6820,340.0
4,LP1004,Male,No,2,Graduate,No,14716,300.0
...,...,...,...,...,...,...,...,...
95,LP1095,Female,Yes,2,Not Graduate,No,8441,60.0
96,LP1096,Female,No,3+,Not Graduate,No,24886,490.0
97,LP1097,Male,No,0,Graduate,Yes,11709,300.0
98,LP1098,Male,No,2,Not Graduate,NaN,19215,180.0
99,LP1099,Male,No,0,Not Graduate,NaN,22145,300.0

In [119]:
df.isnull().sum()

Loan_ID             0
Gender              9
Married             3
Dependents         10
Education           0
Self_Employed      17
ApplicantIncome     0
LoanAmount          0
dtype: int64

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Loan_ID          100 non-null    object
 1   Gender           91 non-null     object
 2   Married          97 non-null     object
 3   Dependents       90 non-null     object
 4   Education        100 non-null    object
 5   Self_Employed    83 non-null     object
 6   ApplicantIncome  100 non-null    int64
 7   LoanAmount       100 non-null    float64
dtypes: float64(1), int64(1), object(6)
memory usage: 6.4+ KB

In [ ]:
df.select_dtypes(include="object").columns                      # selects particular datatype

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed'],
      dtype='object')

In [123]:
from sklearn.impute import SimpleImputer

In [126]:
si = SimpleImputer(strategy="most_frequent")
ar = si.fit_transform(df[['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed']])

In [127]:
new = pd.DataFrame(ar,columns=df.select_dtypes(include="object").columns)

In [128]:
new.head(10)

  Loan_ID  Gender Married Dependents     Education Self_Employed
0  LP1000    Male     Yes          2      Graduate            No
1  LP1001    Male     Yes          0      Graduate            No
2  LP1002  Female     Yes          0      Graduate            No
3  LP1003  Female     Yes         3+      Graduate            No
4  LP1004    Male      No          2      Graduate            No
5  LP1005    Male     Yes          0  Not Graduate            No
6  LP1006    Male     Yes          0      Graduate            No
7  LP1007  Female      No          2      Graduate           Yes
8  LP1008  Female     Yes          0  Not Graduate            No
9  LP1009  Female     Yes          0      Graduate           Yes

In [129]:
new.isnull().sum()

Loan_ID          0
Gender           0
Married          0
Dependents       0
Education        0
Self_Employed    0
dtype: int64